Question:

A hospital wants to determine whether there is any difference in the average Turn Around Time (TAT) of reports of the laboratories on their preferred list. They collected a random sample and recorded TAT for reports of 4 laboratories. TAT is defined as sample collected to report dispatch.
   
Analyze the data and determine whether there is any difference in average TAT among the different laboratories at 5% significance level.

In [1]:
import pandas as pd
import numpy as np
from scipy import stats

In [4]:
data = pd.read_csv("LabTAT (1).csv")
data.shape

(120, 4)

In [5]:
data.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [8]:
data.describe()

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

Assumptions:

H0: mu(Laboratory 1) = mu(Laboratory 2) = mu(Laboratory 3) = mu(Laboratory 4)
i.e. there is no difference in the average Turn Around Time (TAT) of reports of the 4 - laboratories

H1: At least one of average TAT is not equal to other three.
i.e. there is some difference in the average Turn Around Time (TAT) of reports of the 4 - laboratories

Here, we got a data for 4 different laboratories and we are analyzing the outcomes based on only one factor i.e. Average Turn Around Time (TAT), hence oneway ANOVA test will be applicable for this problem statement.

In [16]:
stats.f_oneway(data.iloc[:,0], data.iloc[:,1], data.iloc[:,2], data.iloc[:,3])

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

Here, 
pvalue=2.1156708949992414e-57 which is much less than (Î± = 0.05).
Hence we will reject Null Hypothesis (H0) and accept alternate hypothesis (H1).

Result:
there is some difference in the average Turn Around Time (TAT) of reports of the 4 - laboratories.